certificate_select_value = """
Выберите номинал сертификата:
"""


certificate_enter_email = """
Ответным сообщением укажите электронную почту для получения сертификата:
"""


certificate_go_to_payment = """
После оплаты, отправьте чек ответным сообщением и сертификат будет отправлен на {} в ближайшее время.
Удачных покупок!
"""

certificate_after_payment = """
Спасибо! Платёжная операция зарегистрирована.
"""


registration_message = """
Для регистрации в бонусной программе
1) Вступите в нашу группу
2) Напишите в одном сообщении:
- Вашу фамилию и имя
- Номер телефона
- Дату рождения
- Фамилию продавца
"""


registration_confirmation = """
Ваши данные направлены менеджеру для проверки и регистрации.
"""


get_balance_message = """
Укажите Ваш номер телефона и мы напишем баланс бонусных баллов:
"""


get_balance_response = """
{}
Информация о балансах обновляется раз в день.
"""


ask_manager_message = """
Напишите ваш вопрос:
"""


to_admin_photo_attachment = """
Пользователь {} (vk.com/id{}) прислал вложение (VK API позволяет переслать только текст, фото, видео и музыку).

{}
"""


ask_manager_confirmation = """
Ваш вопрос отправлен менеджеру.
"""


to_admin_customer_question = """
Пользователь {} (vk.com/id{}) задал вопрос:

{}
"""


to_admin_customer_registration = """
Пользователь {} (vk.com/id{}) заполнил анкету для регистрации в бонусной программе:

{}
"""


to_admin_processing_certificate = """
Пользователь: {} (vk.com/id{})
email: {}
Приступил к оформлению сертификата номиналом {} рублей.
"""


to_admin_buy_certificate = """
Пользователь {} (vk.com/id{}, email: {}), оформляющий покупку сертификата номиналом {} рублей, отправил сообщение:

{}
"""


to_admin_cancel_certificate = """
Пользователь {} (vk.com/id{}) отменил покупку сертификата номиналом {} рублей.
"""


balance_found = """
Счёт: {}
Баланс бонусных баллов: {}
"""

multiple_balance_found = """
В базе найдено больше одного соответствия. Обратитесь к менеджеру.
Балансы, привязанные к номеру {}: {}
"""

balance_not_found = """
Счёт {} не найден в базе данных. Обратитесь к менеджеру для уточнения информации или регистрации в бонусной программе.
"""


too_many_balances = """
Ошибка идентификации баланса {}. Обратитесь к менеджеру для уточнения информации.
"""

